Repository: mohitexpo007/Ocean-Hazard-App
Catalog: lib/l10n/app_*.arb
Languages: hi

# appTitle
source: MyOceanApp
hi: मायओशनऐप

# chatbotTitle
source: 🌊 Ocean Disaster Chatbot
hi: 🌊 महासागर आपदा चैटबॉट

# askPlaceholder
source: Ask about disasters...
hi: आपदाओं के बारे में पूछें...

source: Send
hi: भेजें

source: Loading...
hi: लोड हो रहा है...

# serverError
source: ⚠️ Server error. Please try again.
hi: ⚠️ सर्वर त्रुटि। कृपया पुनः प्रयास करें।

# connectError
source: ⚠️ Could not connect to disaster server.
hi: ⚠️ आपदा सर्वर से कनेक्ट नहीं हो सका।

source: Nearby Reports:
hi: पास के रिपोर्ट:

# latestNews
source: Latest Disaster News:
hi: ताज़ा आपदा समाचार:

# fallbackMsg
source: Sorry, I don’t have info on that right now. Stay safe and follow official alerts.
hi: क्षमा करें, अभी मेरे पास जानकारी नहीं है। सुरक्षित रहें और आधिकारिक अलर्ट का पालन करें।

source: Notifications
hi: सूचनाएँ

# noNotifications
source: No notifications yet
hi: अभी कोई सूचना नहीं

source: Clear
hi: साफ़ करें

source: Language
hi: भाषा

source: Choose language
hi: भाषा चुनें

source: Hindi
hi: हिन्दी

source: Location error
hi: स्थान त्रुटि

# permDenied
source: Camera or gallery permission denied
hi: कैमरा या गैलरी अनुमति अस्वीकार

source: Select Image Source
hi: छवि स्रोत चुनें

source: Camera
hi: कैमरा

source: Gallery
hi: गैलरी

# syncedAndRemoved
source: Synced and removed cached report
hi: सिंक किया और कैश की गई रिपोर्ट हटाई

# syncFailedWillRetry
source: Failed to sync report, will retry later
hi: सिंक विफल, बाद में पुनः प्रयास होगा

# fillAllFields
source: Please fill all fields & get location
hi: कृपया सभी फ़ील्ड भरें और स्थान प्राप्त करें

# savedOffline
source: Saved offline, will sync later
hi: ऑफ़लाइन सहेजा गया, बाद में सिंक होगा

# cachedWillSync
source: Report cached, will sync when online
hi: रिपोर्ट कैश में सहेजी, इंटरनेट आने पर सिंक होगी

# genericError
source: Error
hi: त्रुटि

# thankYouReport
source: Thank you for your report
hi: आपकी रिपोर्ट के लिए धन्यवाद

# reportSubmittedAppreciate
source: Your report has been successfully submitted. We appreciate your contribution to making our community safer.
hi: आपकी रिपोर्ट सफलतापूर्वक जमा हो गई है। समुदाय को सुरक्षित रखने में आपके सहयोग की सराहना है।

source: Report Summary
hi: रिपोर्ट सारांश

source: Hazard Type
hi: खतरे का प्रकार

# locationLabel
source: Location
hi: स्थान

source: Lat
hi: अक्षांश

source: Lng
hi: देशांतर

source: Severity
hi: गंभीरता

# descriptionLabel
source: Description
hi: विवरण

source: View Report
hi: रिपोर्ट देखें

# returnHome
source: Return to Home
hi: होम पर जाएँ

# hazardTypeEmoji
source: 🌊 Hazard Type
hi: 🌊 खतरे का प्रकार

source: Select hazard type
hi: खतरे का प्रकार चुनें

# severityLevelEmoji
source: ⚠️ Severity Level
hi: ⚠️ गंभीरता स्तर

# locationEmoji
source: 📍 Location
hi: 📍 स्थान

# locationHint
source: Current location detected...
hi: वर्तमान स्थान प्राप्त...

source: Get location
hi: स्थान प्राप्त करें

# descriptionEmoji
source: 📝 Description
hi: 📝 विवरण

# describeHint
source: Describe what you're observing...
hi: आप क्या देख रहे हैं, लिखें...

source: Enter description
hi: विवरण दर्ज करें

# addMediaEmoji
source: 📷 Add Photo/Video
hi: 📷 फोटो/वीडियो जोड़ें

# tapToAddMedia
source: Tap to add photos or videos
hi: फोटो या वीडियो जोड़ने के लिए टैप करें

source: Submit Report
hi: रिपोर्ट जमा करें

# pendingOfflineEmoji
source: 📌 Pending Reports (Offline)
hi: 📌 लंबित रिपोर्ट (ऑफ़लाइन)

source: Sync Now
hi: अभी सिंक करें

source: Key Features
hi: मुख्य विशेषताएँ

source: Hello,
hi: नमस्ते,

source: ⚡ Quick Actions
hi: ⚡ त्वरित क्रियाएँ

source: Report Hazard
hi: खतरे की रिपोर्ट करें

source: Live Monitoring
hi: लाइव मॉनिटरिंग

source: 📍 Hazard Map View
hi: 📍 खतरा मानचित्र दृश्य

source: Live Incidents
hi: लाइव घटनाएँ

source: Predictions
hi: अनुमान

source: Active Alerts
hi: सक्रिय अलर्ट

source: Reports Today
hi: आज की रिपोर्ट

source: Accuracy
hi: सटीकता

source: Submit Hazard Report
hi: खतरे की रिपोर्ट जमा करें

source: Navigation
hi: नेविगेशन

source: Dashboard
hi: डैशबोर्ड

source: Analytics
hi: एनालिटिक्स

source: My Reports
hi: मेरी रिपोर्ट

source: Chatbot
hi: चैटबॉट

source: Scraped Reports
hi: स्क्रैप की गई रिपोर्ट
